; domain
(define (domain furniture-assembly)
	(:requirements :strips :typing)
	(:types
		tool tool-part - object
		table-top table-leg chair-base chair-leg chair-seat shelf-frame shelf-box desk-plane desk-drawer - tool
		handle-part action-part - tool-part
		gripper
	)

	(:predicates
		(on ?t1 - tool ?t2 - tool)
		(on-floor ?t - tool)
		(clear ?t - tool)
		(empty ?g - gripper)
		(in-hand ?g - gripper ?t - tool)
		(screwed-into ?t - tool ?s - tool)
        (connected-to ?t - tool ?s - tool)
		(part-of ?tp - tool-part ?t - tool)
		(affords-picking ?tp - handle-part)
		(affords-screwing ?tp - action-part)
        (affords-connecting ?tp - action-part)
		(affords-hammering ?tp - action-part)
		(affords-turning-on ?tp - action-part)
		(affords-turning-off ?tp - action-part)
		(affords-placing ?t - tool)
		(affords-screwing-into ?s - tool ?tp - tool-part ?t - tool)
        (affords-connecting-to ?s - tool ?tp - tool-part ?t - tool)
	)

	(:action pick-up-from-tool
		:parameters (?g - gripper ?tp - handle-part ?t - tool ?s - tool)
		:precondition (and (clear ?t) (empty ?g) (on ?t ?s) (part-of ?tp ?t) (affords-picking ?tp))
		:effect (and (in-hand ?g ?t) (clear ?s) (not (clear ?t)) (not (empty ?g)) (not (on ?t ?s)))
	)

	(:action pick-up-from-floor
		:parameters (?g - gripper ?tp - handle-part ?t - tool)
		:precondition (and (clear ?t) (empty ?g) (on-floor ?t) (part-of ?tp ?t) (affords-picking ?tp))
		:effect (and (in-hand ?g ?t) (not (clear ?t)) (not (empty ?g)) (not (on-floor ?t)))
	)

	(:action put-on-floor
		:parameters (?g - gripper ?t - tool)
		:precondition (and (in-hand ?g ?t) (affords-placing ?t))
		:effect (and (on-floor ?t) (clear ?t) (empty ?g) (not (in-hand ?g ?t)))
	)

	(:action screw-into
		:parameters (?g - gripper ?tp - action-part ?tl - tool ?th - tool-part ?tt - tool)
		:precondition (and (in-hand ?g ?tl) (part-of ?tp ?tl) (affords-screwing ?tp) (part-of ?th ?tt) (affords-screwing-into ?tl ?th ?tt))
		:effect (and (screwed-into ?tl ?tt) (clear ?tl) (empty ?g) (not (in-hand ?g ?tl)))
	)

    (:action connect-to
		:parameters (?g - gripper ?tp - action-part ?tl - tool ?th - tool-part ?tt - tool)
		:precondition (and (in-hand ?g ?tl) (part-of ?tp ?tl) (affords-connecting ?tp) (part-of ?th ?tt) (affords-connecting-to ?tl ?th ?tt))
		:effect (and (connected-to ?tl ?tt) (clear ?tl) (empty ?g) (not (in-hand ?g ?tl)))
	)
)

; problem
(define (problem table-assembly-full)
	(:domain furniture-assembly)
; just fill in one possibility: connect column to base, then connect seat to column, to avoid multiple choice, which is hard to select from in current setting
	(:objects
		seat - chair-seat
		column - chair-leg
        base - chair-base
		seat-edge column-end base-leg - handle-part
		seat-connect column-screw - action-part
		column-connector base-hole - tool-part
		robot-gripper - gripper
	)

	(:init
		(on-floor seat)
		(on-floor column)
		(on-floor base)

		(clear seat)
		(clear column)
		(clear base)

		(empty robot-gripper)

		(part-of seat-edge seat)
		(part-of column-end column)
		(part-of base-leg base)

		(part-of seat-connect seat)
        (part-of column-screw column)
        (part-of column-connector column)
        (part-of base-hole base)

		(affords-picking seat-edge)
		(affords-picking column-end)
		(affords-picking base-leg)

		(affords-connecting seat-connect)
		(affords-connecting-to seat column-connector column)
        
        (affords-screwing column-screw)
		(affords-screwing-into column base-hole base)
	)

	(:goal (and (connected-to seat column)
				(screwed-into column base)
		   	)
	)
)

; plan
1. (pick-up-from-floor robot-gripper seat-edge seat)
   deleted: (clear seat) (empty robot-gripper) (on-floor seat)
   added: (in-hand robot-gripper seat)
   goals met: 0 of 2
2. (connect-to robot-gripper seat-connect seat column-connector column)
   deleted: (in-hand robot-gripper seat)
   added: (connected-to seat column) (clear seat) (empty robot-gripper)
   goals met: 1 of 2
3. (pick-up-from-floor robot-gripper column-end column)
   deleted: (clear column) (empty robot-gripper) (on-floor column)
   added: (in-hand robot-gripper column)
   goals met: 1 of 2
4. (screw-into robot-gripper column-screw column base-hole base)
   deleted: (in-hand robot-gripper column)
   added: (screwed-into column base) (clear column) (empty robot-gripper)
   goals met: 2 of 2
